//
// Created by Elena Petkovska on 8.4.25.
//

/* Lab 09/12/2024 */

/* Од стандарден влез се внесува број n (димензии за квадратна матрица).
 * Потоа се внесува матрицата. Да се трансформира матрицата така што секој елемент кој се наоѓа
 * во исто време под главната и споредната дијагонала во обратен број. Обратен број на некој број е
 * ако тој е позитивен да се претвори во негативен број, а ако бројот е негативен да се претвори во
 * позитивен број. Објаснување за првиот тест пример броевите што се задебелени се наоѓаат под главната и споредната дијагонала. */

/* TO-DO Steps:
 * 1. Од стандарден влез се внесува број n (димензии за квадратна матрица).
 * 2. Потоа се внесува матрицата.
 * 3. Да се трансформира матрицата така што секој елемент кој се наоѓа во исто време под главната и споредната дијагонала во обратен број.
 * 4. Обратен број на некој број е ако тој е позитивен да се претвори во негативен број, а ако бројот е негативен да се претвори во позитивен број.
 * 5. Објаснување за првиот тест пример броевите што се задебелени се наоѓаат под главната и споредната дијагонала. */

#include <iostream>
using namespace std;

int main()
{
    int n;;
    cin >> n;

    int matrix[100][100];

    //Vcituvanje na matricata
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < n; j++)
        {
            cin >> matrix[i][j];
        }
    }

    //Zamena na elementi pod glavnata i pod sporednata dijagonala
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < n; j++)
        {
            matrix[i][j] = -matrix[i][j];
        }
    }

    //Pecatenje na krajnata matrica
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < n; j++)
        {
            cout << matrix[i][j] << " ";
        }
        cout << endl;
    }
    return 0;
}

