//
// Created by Elena Petkovska on 8.4.25.
//

/* Kvalifikaciski */

/* Од стандарден влез прочитајте една низа од точно 17 цели броеви, елемент по елемент.
На пример, низата на влез е: 2, 9, 22, 17, ‒4, 3, ‒1, 9, 12, 58, ‒7, 0, 4, 5, 33, 18, ‒55.
Отпечатете го во редослед, секој втор елемент од низата, во еден ред, одделени со по едно празно место.
Пример за излез: 9 17 3 9 58 0 5 18 */

#include <iostream>
using namespace std;

int main()
{
    int numbers[17]={2, 9, 22, 17, -4, 3, -1, 9, 12, 58, -7, 0, 4, 5, 33, 18, -55};

    for (int i = 1; i < 17; i +=2)
    {
        cout << numbers[i] << " ";
    }

    cout << endl;
    return 0;
}


