// Created by Elena Petkovska on 4.6.2025.
//

/* Courses FINKI 2024/25 - Zadachi za vezhbanje za 1 kolokvium */

/* TO-DO Steps:
* 1. Од тастатура се чита број m (m > 2).
* 2. Се печати квадратна слика со должина m користејќи ги знаците '@', '%', и '.'.
* 3. Надворешниот раб на квадратот се составува од знаците '%'.
* 4. Вториот ред и претпоследниот ред се составуваат од: '%' + (m-2) пати '@' + '%'.
* 5. Сите редови помеѓу вториот и претпоследниот се составуваат од: '%' + (m-2) пати '.' + '%'.
* 6. Сликата завршува со знак за нов ред, без дополнителни празни редови.
* 7. Забелешка: Не е дозволено користење на низа/матрица.
*
* For Example:
* Input:
* 11
* Result:
* %@@@@@@@@@%
* %.........%
* %.........%
* %.........%
* %.........%
* %.........%
* %.........%
* %.........%
* %.........%
* %.........%
* %@@@@@@@@@%
*/

#include <iostream>
using namespace std;

int main() {
    int m;
    cin >> m;

    if (m <= 2) { return 1;}

    for (int i = 0; i < m; i++)
    {
        for (int j = 0; j < m; j++)
        {
            if (i == 0 || i == m - 1) {
                if (j == 0 || j == m - 1) cout << "%";
                else cout << "@";
            }
            else {
                if (j == 0 || j == m - 1) cout << "%";
                else cout << ".";
            }
        }
        cout << endl;
    }
    return 0;
}
