//
// Created by Elena Petkovska on 14.8.25.
//

// Predavanje 11 - Pokazhuvaci

/* Константни покажувачи */

#include <iostream>
using namespace std;

int main() {
	int a = 1, b = 2, x;

	// Покажувач кон константна меморија
	int const *cip = &a;   // cip покажува кон константна меморија
	x = *cip;              // може да ја прочита вредноста
	cip = &b;              // cip може да се пренасочи кон друга локација
	//*cip = a;            // НЕ МОЖЕ - грешка, бидејќи cip секогаш покажува кон константна меморија

	// Константен покажувач кон меморија
	int * const icp = &a;  // icp е константен покажувач кон меморија
	x = *icp;              // читање на вредност
	*icp = b;              // може да ја смени содржината на меморијата на која покажува
	//icp = &b;            // НЕ МОЖЕ - грешка, не може да се пренасочи на друга адреса

	// Константен покажувач кон константна меморија
	int const * const icp2 = &a;  // ни адресата, ни вредноста не можат да се менуваат

	return 0;
}
